## Pandas
# Assignment No 04
### 20UCS304

### Basics of Pandas

In [1]:
import pandas as pd

## 1. Series

In [2]:
s=pd.Series()
print(s)

Series([], dtype: float64)

- create series using numpy array

In [3]:
import numpy as np
arr=np.array(['A','B', 'C', 'D', 'E', 'F'])
s=pd.Series(arr)
s

0    A
1    B
2    C
3    D
4    E
5    F
dtype: object

- Assigning custom index to series

In [4]:
s=pd.Series(arr,index=[101,102,103,104,105,106])
s

101    A
102    B
103    C
104    D
105    E
106    F
dtype: object

- Indexing series

In [5]:
s[101]

'A'

## 2. Dataframe

- Creating empty data frame

In [6]:
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

- Creating data frame using list

In [7]:
li=[10,20,30,40,50]
df=pd.DataFrame(li)
print(df)

    0
0  10
1  20
2  30
3  40
4  50

In [8]:
li=[[1,'React'],[ 2,'Angular'],[3, 'Next']]
df2=pd.DataFrame(li)
print(df2)

   0        1
0  1    React
1  2  Angular
2  3     Next

- Creating data frame using Dictonary

In [9]:
di={'Name':['A', 'B', 'C', 'D', 'E', 'F'],'Rank':[2,4,1,3,6,5]}
df3=pd.DataFrame(di)
print(df3)

  Name  Rank
0    A     2
1    B     4
2    C     1
3    D     3
4    E     6
5    F     5

- Create list using series

In [10]:
s={'language':pd.Series(['Java','Python','JS','TypeScript'],index=[0,1,2,3]),'framework':pd.Series(['Spring','Flask','React','Angular'],index=[0,1,2,3])}
df4=pd.DataFrame(s)
print(df4)

     language framework
0        Java    Spring
1      Python     Flask
2          JS     React
3  TypeScript   Angular

- Accessing columns

In [11]:
df4['language']

0          Java
1        Python
2            JS
3    TypeScript
Name: language, dtype: object

- Checking null values

In [12]:
df4['language'][0]=None

In [13]:
df4.isna()

   language  framework
0      True      False
1     False      False
2     False      False
3     False      False

- Calculating null values count

In [14]:
df4.isna().sum()

language     1
framework    0
dtype: int64

## 3.Reading CSV file using Pandas

- Reading .csv

In [15]:
marks=pd.read_csv(r'data/df_example.csv')
print(marks)

   rollno   name  marks
0       1  Alice     90
1       2    Bob     88
2       3  Jerry     93
3       4    NaN     74

- Printing shape of data

In [16]:
rows,columns = marks.shape
(rows,columns)

(4, 3)

- Printing top few recors

In [17]:
marks.head(2)

   rollno   name  marks
0       1  Alice     90
1       2    Bob     88

- Printing bottom few records

In [18]:
marks.tail(2)

   rollno   name  marks
2       3  Jerry     93
3       4    NaN     74

- Column Names

In [19]:
marks.columns

Index(['rollno', 'name', 'marks'], dtype='object')

- Printing specific columns

In [20]:
marks[['name']]

    name
0  Alice
1    Bob
2  Jerry
3    NaN

- Get max marks

In [21]:
marks['marks'].max()

93

- Descibing the data frame

In [22]:
marks.describe()

         rollno      marks
count  4.000000   4.000000
mean   2.500000  86.250000
std    1.290994   8.421203
min    1.000000  74.000000
25%    1.750000  84.500000
50%    2.500000  89.000000
75%    3.250000  90.750000
max    4.000000  93.000000

- Quering data from df

In [23]:
marks[marks.marks>=90]

   rollno   name  marks
0       1  Alice     90
2       3  Jerry     93

- Replacing indices

In [24]:
marks.index
marks

   rollno   name  marks
0       1  Alice     90
1       2    Bob     88
2       3  Jerry     93
3       4    NaN     74

In [25]:
marks.set_index('rollno')

         name  marks
rollno
1       Alice     90
2         Bob     88
3       Jerry     93
4         NaN     74

## 4. Exporting to csv

In [26]:
df4

     language framework
0        None    Spring
1      Python     Flask
2          JS     React
3  TypeScript   Angular

In [27]:
df4.to_csv(r'data/courses.csv')